Courses/7140/Lectures/Examples/Small-Set/java-asserts.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-12 Sat 20:35 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Java Assert Practical Issues via SmallSet of Int Example</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Prabhaker Mateti" />
<meta name="description" content="Mateti: OO Programming and Design"
 />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../"> HOME </a>
</div><div id="preamble" class="status">
2018-07-20 | <a href="../../"> ../../</a>
</div>
<div id="content">
<h1 class="title">Java Assert Practical Issues via SmallSet of Int Example</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd8eed28">1. SmallSet Implementation Context</a></li>
<li><a href="#orgad65116">2. Abstraction Function</a></li>
<li><a href="#org01556a2">3. Code of Assertions</a></li>
<li><a href="#orgb5b51fb">4. End</a></li>
</ul>
</div>
</div>
<p>
Abstract: This article jots down a few "gotchas" in using assertions
in a real Java program.  In the src code for every Java class, our
goal is to include the class invariant as part of (i) both a pre- and
a post-condition for every public method, and (ii) a post-condition of
every constructor.
</p>

<div id="outline-container-orgd8eed28" class="outline-2">
<h2 id="orgd8eed28"><span class="section-number-2">1</span> SmallSet Implementation Context</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li><a href="./smallset-impl.html">./smallset-impl.html</a> implemented in Java</li>
<li>Includes assertions.  Does not use JML.</li>
<li>This is NOT an implementation of Java Set container.</li>
<li>Note: The code may contain bugs, and other issues.  It is intended
to be used in various teaching purposes.</li>
</ol>
</div>
</div>

<div id="outline-container-orgad65116" class="outline-2">
<h2 id="orgad65116"><span class="section-number-2">2</span> Abstraction Function</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>setOf(SmallSet s) is the abstraction function.  Intended to be used
<b>only</b> in assertions.</li>
<li>The code for setOf() uses compact().</li>
</ol>
</div>

<div id="outline-container-org455d0ab" class="outline-3">
<h3 id="org455d0ab"><span class="section-number-3">2.1</span> Compact</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>compact(s) is a function, based on the information hiding
principle, removes duplicates, while preserving the abstraction of
s.  So, the object s before and after abstractly-equals the same
setOf(s), as in, taking liberties with our notation,
setOf(s.before) == setOf(s.after).</li>
<li>We happen to have declared compact(s) public.  So, we must have
classInv.  setOf(this) == setOf(newset).</li>
<li>You can see the recursion.  This will be endless, because depending
on s, there is no escape.</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org01556a2" class="outline-2">
<h2 id="org01556a2"><span class="section-number-2">3</span> Code of Assertions</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>The expressions used in pre- post and class invariants ought to be
disjoint from the code of all methods.  Had we done the assertions
in JML, this would have been clear.  Why? Bugs in the methods will
alter the true/false results of assertions.</li>

<li>For several best-practice-without-JML reasons, the SmallSet.java
implementation did not do the above.  It "reused" the code of a
couple of public and private methods.</li>
</ol>
</div>

<div id="outline-container-org74d3f46" class="outline-3">
<h3 id="org74d3f46"><span class="section-number-3">3.1</span> Failed Expectation of the Compiler</h3>
<div class="outline-text-3" id="text-3-1">
<ol class="org-ol">
<li>Having reused the code, when a method M is being invoked as part of
an assertion evaluation, assertions of M ought to be ignored.</li>

<li>More TBD</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orgb5b51fb" class="outline-2">
<h2 id="orgb5b51fb"><span class="section-number-2">4</span> End</h2>
<div class="outline-text-2" id="text-4">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2018 <a href="http://www.wright.edu/~pmateti">www.wright.edu/~pmateti</a>
</div>
</body>
</html>
